# test01.py


# 본인데이터 
#  ㄴ이름,나이, 
#  ㄴ성별,주소
#  ㄴ포인터점수 7.8 실수 

# 컴퓨터언어는 대소문자구별,  문장마지막 종료 ;
# 컴퓨터언어는 타입 숫자, 문자, 문자열, 불
# 파이썬언어는 대소문자구별 

# 파이썬 변수,연산, 처리 화면모니터출력 print()
# 파이썬 타입지정X
# 파이썬 문장마지막 ; 생략
# 파이썬 명령어 짧아요 = 축약 
# 파이썬 모니터출력 print() 자동라인개행=엔터기능
# 파이썬 모니터출력 print('안내메세지', 값)

# 문제1 본인정보 최소 3가지 출력 이름,나이
# 확장해서 공부할때 고정데이터를 키보드입력 input('안내문')
# 고길동 데이터입력은 변수 = input('안내문') 
# 입력한 이름데이터 출력 

# 문제2 나이입력후 
# if조건  20~70입력 20~30청년  31~64중년 65세이상 노년

# test01.py문서
# 문자데이터 반드시 ' '  " "
print('홍길동')
print(24) 
print(78.9)


# 문제3 본인정보  출력 이름,나이 5회이상 
# 1회이상 반복문 - for,while
# 1회이상 반복처리 함수구현후 호출 







print() 
print()
'''
다른언어 java,C#, C, VB, PowerBuilder
char[] name = '길'
String nick = "길동"

int age = 24 
float point = 7.8

bool gender = true
'''

